Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: It's party time! We've prepared a lot of fun stuff for the festivities so everyone can have the time of their lives! Test your strength against the Archdemon, grab the new Stellar Skins along with a Skin+ for Iris, and don't miss out on the chance to get lots of resources to power-up your teams.
pt_pt: Vamos à festa! Temos um monte de coisas divertidas para a celebração, de certeza que te vais divertir a valer! Mostra o que vales contra o Archdemon e não percas os novos visuais Estelares e um Visual+ para Iris! Além disso, ainda podes ganhar uma tonelada de recursos para melhorar as tuas equipas.

source: Dragon Tales
pt_pt: Contos do Dragão

source: We are constantly improving and updating our game mechanics.
pt_pt: Procuramos melhorar e atualizar regularmente a jogabilidade.

source: We’re excited to introduce our new Tower game at the City Gate, which offers exciting rewards such as Gold, Energy, and even Heroes!
pt_pt: Apresentamos o nosso modo Torre no Portão da Cidade, que oferece emocionantes recompensas como Ouro, Energia e até Heróis!

source: Stick around to see if our thrilling game is worth your time.
pt_pt: Fica por perto para ver se o nosso jogo merece a tua atenção.

source: It's time for Titan Brawls!
pt_pt: Hora das Brigas de Titãs!

source: Romantic Update!
pt_pt: Atualização Romântica!

source: Romantic skins Keira, Amira, and Jorgen are ready to win your heart over with their new Valentine’s Day outfits!
pt_pt: Visuais românticos Keira, Amira e Jorgen estão prontos a conquistar-te com visuais do Dia dos Namorados!

source: Keira’s image can be further enhanced with a dash of femme fatale charm!
pt_pt: O estilo da Keira vai ser reforçado com um toque de femme fatale!

source: How about a round of Bingo?
pt_pt: Queres jogar Bingo?

source: Complete tasks in the new event to win rewards!
pt_pt: Completa tarefas no novo evento e ganha recompensas!

source: Captains Tournament Help Captain Jean defeat Grim Fang and compete with other captains!
pt_pt: Torneio de Capitães Ajuda o Capitão Jean a derrotar a Presa Sangrenta e enfrenta outros capitães!

source: Explore new skills, battle modules, and a new Skyship battle mechanic.
pt_pt: Explora novas habilidades, módulos de batalha e uma nova mecânica de batalhas de aeronaves.

source: Prove yourself and become a Champion!
pt_pt: Mostra o que vales, torna-te Campeão!

source: An ocean’s worth of new stuff!
pt_pt: Um oceano de novidades!

source: Among the Waves Clad in their brand new Dark Depths Skins, Isaac and Julius are ready to tackle waves of enemies!
pt_pt: Entre as Ondas Com os Visuais Profundezas Escuras, Isaac e Julius estão prontos para enfrentar ondas de inimigos!

source: Complete the event quests to upgrade Isaac’s new outfit even more!
pt_pt: Conclui missões do evento para melhorar ainda mais o novo fato de Isaac!

source: Trendy Talismans Check out the new selection of talismans for Faceless, Jet, Jhu, Jorgen, Xe'Sha, and Nebula!
pt_pt: Talismãs da Moda Espreita a nova seleção de talismãs para Sem Rosto, Jet, Jhu, Jorgen, Xe'Sha e Nebula!

source: Power them up and sit back as they soar to new heights and turn the tide of battle in your favor!
pt_pt: Reforça-os e vê-os a virar a maré da batalha em teu favor!

source: Dive headfirst into new adventures!
pt_pt: Mergulha de cabeças em novas aventuras!

source: Ethereal Abundance
pt_pt: Abundância Etérea

source: For many years the mushroom forces grew unnoticed in the thicket of the forest and is now ready to fight! Join in, Hero!
pt_pt: Durante anos, as forças dos cogumelos cresceram nas profundezas da floresta. Agora estão prontas para lutar, herói!

source: Successfully linked
pt_pt: Associação bem-sucedida

source: Change your e-mail subscription settings or unsubscribe
pt_pt: Altera as tuas definições de subscrição de e-mail ou anula a subscrição

source: Set Leprecats free, earn lots of well-deserved prizes and make sure to check out reworked Artemis in action!
pt_pt: Liberta os gnomolinos, conquista prémios bem merecidos e espreita a renovada Ártemis em ação!

source: Assemble the best team and unleash its full power!
pt_pt: Junta a melhor equipa e mostra o que vales!

source: Japanese Yen
pt_pt: Iene japonês

source: Upgrade your Guardians with new Romantic Skins!
pt_pt: Melhora os teus Guardiões com Visuais Românticos!

source: THE GUY SHE TELLS YOU NOT TO WORRY ABOUT
pt_pt: O TIPO QUE ELA DESVALORIZA

source: Heroes, titan artifacts, and boss fights: this patch is to excite! Festive Spirit A not-so-foolish April Fool's Day sale and Easter are around the corner! Don't forget to visit the all-new VIP shop! What's New The Dominion meets a new hero, Tristan, and a new special: Blessed. The special has also been given to the newly buffed Helios and five other heroes of the Light! Might of the Titans Titans can now gain artifacts. Get them by defeating the guild boss! Best of luck, Brave Hero!
pt_pt: Heróis, artefactos de titãs e lutas contra bosses: vai ser um patch incrível! Espírito Festivo Prepara-te para promoções bem porreiras no Dia das Mentiras e na Páscoa! Visita a nova loja VIP! Novidades Vai chegar um novo herói ao Dominion: Tristan, com o seu especial Blessed, que também podes usar com o Helios reforçado e cinco outros heróis da Luz! Poder dos Titãs Eles agora podem derrotar o boss da guilda para obter artefactos! Boa sorte, bravo herói!

source: Follow the Hero's Way with the new Battle Pass!
pt_pt: Siga o Caminho do Herói com o novo Battle Pass!

source: Defeat your enemy and grow your power
pt_pt: Derrota o inimigo e ganha poder

source: Fast
pt_pt: Combate

source: We believe that only you can tame the Chaos that engulfed the lands of this world and we do our best to help you!
pt_pt: Acreditamos que só tu podes dominar o Caos que envolveu os territórios deste mundo e vamos fazer o nosso melhor para te ajudar!

source: Harness the Darkness and summon a new Titan in the Master of Shadows event!
pt_pt: Domina a Escuridão e invoca um novo Titã no evento Mestre das Sombras!

source: Come join the merry fray and get cool rewards!
pt_pt: Junta-te à luta e ganha recompensas!

source: and
pt_pt: e com a nossa

source: Grow this Way of Chaos Healer’s power!
pt_pt: Aumenta o poder do curandeiro do Caminho do Caos!

source: New skins for Cascade and Ginger on sale!
pt_pt: Novos visuais para Cascade e Ginger em promoção!

source: Sending...
pt_pt: A enviar...

source: Upgrade the Chaos Mage this December!
pt_pt: Melhora a Feiticeira do Caos este dezembro!

source: We can totally understand how it feels when energy runs out The good thing though is that there are plenty of ways to earn more energy!
pt_pt: Compreendemos o que sentes quando a energia acaba O lado positivo é que existem formas de ganhar mais energia!

source: Like burning fruits in the cauldron, opening amphoras on the Island, completing boat orders, and many more!
pt_pt: Podes cozinhar frutas no caldeirão, abrir ânforas na Ilha, concluir ordens de barco e muito mais!

source: And don't forget that reaching a new level fills the energy bar to the max ⚡ Hope this was helpful!
pt_pt: Além disso, não te esqueças que alcançar um nível novo enche a barra de energia ao máximo ⚡ Esperamos que esta informação seja útil!

source: Password
pt_pt: Palavra-passe

source: Get lots of resources to upgrade your team!
pt_pt: Obtém muitos recursos para melhorar a tua equipa!

source: Keros is ready to unleash his full strength!
pt_pt: Keros está pronto a mostrar o que vale!

source: Get him on your team in our 3-day special event!
pt_pt: Junta-o à equipa no nosso evento especial de 3 dias!

source: Release the Darkness!
pt_pt: Entra nas trevas!

source: Hey, you should totally check out our Discord server again!
pt_pt: Saudações, porque não espreitas o nosso servidor no Discord!

source: We got daily gifts!
pt_pt: Temos presentes diários!

source: Australian Dollar
pt_pt: Dólar australiano

source: Heroes Rise
pt_pt: Heróis erguidos

source: Your e-mail confirmation link
pt_pt: O teu link de confirmação de e-mail

source: Learn more about the mysterious world of the Dominion with the new Hero, Cascade
pt_pt: Descobre mais sobre o misterioso mundo do Domínio com Dilúvio, o novo Herói

source: Complete quests and earn various prizes!
pt_pt: Conclui missões e ganha muitos prémios!

source: More room for conversations and heroic deeds! Chat update • Improved chat features and visuals to display player avatars and guilds. • Added a context menu. To open it, just tap a message. • The context menu lets you copy the message text (excluding any unofficial URLs). New event: Hero's Way • Perform heroic feats every day to level up and earn rewards worthy of the Dominion's true hero! Enjoy your adventures!
pt_pt: Mais espaço para conversas e heroísmo! Atualização do chat • Melhorámos as opções do chat e o seu aspeto. Agora já podes ver lá os avatares e guildas dos jogadores. • Adicionámos um menu de contexto, basta começar a escrever para abri-lo. • Neste menu podes copiar o texto das mensagens (excluindo URLs não oficiais). Novo evento: Caminho do Herói • Mostra o teu heroísmo todos os dias, sobe de nível e ganha recompensas dignas do maior herói do Domínio! Parte à aventura e diverte-te!

source: Grab this chance to obtain Soul Stones and Celestial Skins for Kayla and Octavia during our themed three-day sale!
pt_pt: Aproveita a oportunidade de obter Pedras Anímicas e Visuais Celestiais para Kayla e Octavia durante a nossa promoção temática de três dias!

source: Water Elemental's Head
pt_pt: Cabeça do Elemental de Água

source: A great way to power up your Progress Heroes!
pt_pt: Melhora os teus Heróis do Progresso!

source: You're in luck: the Magic Tree has appeared in the city!
pt_pt: Estás com sorte: a Árvore Mágica apareceu na cidade!

source: Now it needs nourishment to grow.
pt_pt: Agora precisa de alimento para crescer.

source: Your guild has three days to grow the biggest tree and climb the ranks.
pt_pt: A tua guilda tem três dias para cultivar a maior árvore e subir na classificação.

source: The guild ranking and the value of rewards scale with the tree's level.
pt_pt: A classificação da guilda e o valor das recompensas melhora com o nível da árvore.

source: The outcome of the event is up to you!
pt_pt: O resultado do evento depende de ti!

source: Don't forget to check out the event shop before the event ends!
pt_pt: Não te esqueças de espreitar a loja do evento antes do fim do evento!

source: Croatian Kuna
pt_pt: Kuna croata

source: The Price of Harmony
pt_pt: O Preço da Harmonia

source: Heroes look good in anything! Mythical Makeover New mesmerizing skins will turn Cascade, Oya, and Celeste into real heroes, and you can make Cascade's outfit even more epic by completing event tasks! Talisman Frenzy Max-level players have the rare opportunity to awaken some Hero Talismans. The Keepers' shop is open for business again! Just remember: only max-level Heroes are worthy of such powerful accessories. Become a legend of Dominion!
pt_pt: Os heróis ficam bem em qualquer trapinho! Remodelação Mítica Estão disponíveis novos visuais fantásticos que vão transformar Cascade, Oya e Celeste em verdadeiros heróis! Além disso, se concluíres tarefas do evento, podes melhorar ainda mais o visual de Cascade! Loucura dos Talismãs Jogadores no nível máximo vão poder acordar alguns Talismãs dos Heróis. A loja dos guardiões está de portas abertas! Só para heróis no nível máximo! Forja a tua lenda no Domínio!

source: We appreciate you sharing your thoughts with us.
pt_pt: Obrigado por partilhares a tua opinião connosco.

source: Hero Wars has a wide range of features, making it difficult to cover everything in a brief ad.
pt_pt: O Hero Wars tem várias características e é difícil mostrar tudo num anúncio.

source: We apologize if it didn’t resonate with you, and we’ll pass on your feedback to our marketing team.
pt_pt: Lamentamos se não correspondeu às tuas expetativas, vamos partilhar a tua opinião com a nossa equipa de marketing.

source: We hope you’ll give Hero Wars another chance, especially our exciting new Tower game at the City Gate!
pt_pt: Esperamos que dês uma nova oportunidade ao Hero Wars, especialmente ao modo Torre no Portão da Cidade!!

source: The Outland Update
pt_pt: Atualização da Outland

source: - The support hero Markus becomes stronger!
pt_pt: - Markus, o herói de suporte, ficou mais poderoso!

source: Feel the might of the Order!
pt_pt: Sente todo o poder da Ordem!

source: Community
pt_pt: Comunidade

source: Welcome at long last, Brave Hero!
pt_pt: Bem-vindo finalmente, bravo herói!

source: Whether you’ve come to relive your favorite moments of online-RPG gaming or are just looking to slash your way through a few levels, Hero Wars has you covered.
pt_pt: Quer tenhas vindo para reviver os teus momentos favoritos nos RPG online ou apenas para abrir caminho por alguns níveis, o Hero Wars está aqui para ti.

source: Come for the refined RPG gameplay, stay for the glory!
pt_pt: Vem em busca de jogabilidade RPG refinada, mas fica pela glória!

source: The Summer Nightmare is looming over the Dominion!
pt_pt: O Pesadelo de Verão ameaça o Domínio!

source: Help the heroes of the darkness conquer the world!
pt_pt: Ajuda os heróis das trevas a conquistar o mundo!

source: Complete quests, open stashes, and find rewards for the undead.
pt_pt: Completa missões, obtém saque e encontra recompensas para os mortos-vivos.

source: Phobos, the Harbinger of Nightmare Now buffed and revamped - try him out and leave your enemies cowering in fear!
pt_pt: Phobos, o Augúrio dos Pesadelos Melhorado e renovado - experimenta-o e deixa os inimigos a tremer de medo!

source: Added a Hydra fight log Learn all about the victories of your guildmates over the Hydras.
pt_pt: Adicionado um registo de combates contra a Hidra Fica a conhecer os triunfos dos teus companheiros de guilda contra as Hidras.

source: Make history in the Dominion!
pt_pt: Faz história no Domínio!

source: Log out of account on all devices
pt_pt: Sair da conta em todos os dispositivos

source: The Captains' Showdown!
pt_pt: Conflito de Capitães!

source: Demonic Skin Sale!
pt_pt: Promoção: visuais demoníacos!

source: Play minigames!
pt_pt: Diverte-te em minijogos!

source: Continue?
pt_pt: Continuar?

source: A radiant update!
pt_pt: Uma atualização radiante!

source: Seven Talismans Talismans are now available for players of level 120+!
pt_pt: Sete Talismãs Os Talismãs estão agora disponíveis para jogadores de nível 120+!

source: Collect and upgrade all seven of them, and your Guardians will be pleased!
pt_pt: Recolhe e melhora os sete e cairás nas boas graças dos teus Guardiões!

source: Luminous Fashion The golden hour is dressing Heidi, Kayla, and Aidan up in solar garb!
pt_pt: Moda Luminosa A hora dourada vestiu Heidi, Kayla e Aidan com roupas solares!

source: Kayla's skin can also be upgraded—she will shine like none other!
pt_pt: O visual de Kayla também pode ser melhorado — ela irá brilhar incrivelmente!

source: Heidi Revamped New things bring new powers!
pt_pt: Heidi Transformado Novos elementos trazem novos poderes!

source: Heidi's skills are now better, and he is stronger and even more charming!
pt_pt: As habilidades de Heidi são agora melhores e está mais forte e encantador!

source: Shine bright with your Heroes!
pt_pt: Brilha com os teus Heróis!

source: Pound Sterling
pt_pt: Libra esterlina

source: Upgrade Isaac and stock up on resources!
pt_pt: Melhora o Isaac e reabastece os recursos!

source: There are quite a few ways to earn diamonds in the game!
pt_pt: Existem várias maneiras de ganhares diamantes no jogo!

source: For example, you can get them from completing boat orders or reaching a new level.
pt_pt: Por exemplo, podes obtê-los ao concluir ordens de barco ou ao atingir um novo nível.

source: Also, don't forget about the daily bonus chest Good luck!
pt_pt: Além disso, não te esqueças do baú de bónus diário Boa sorte!

source: If you experience technical issues, please do not hesitate to contact our support team.
pt_pt: Se estiveres com problemas técnicos, não hesites em contactar a nossa equipa de suporte.

source: Our specialists will look into the matter and help you promptly.
pt_pt: Os nossos especialistas vão analisar o problema a solucioná-lo o mais rápido possível.

source: Fill in this webform to make a request: bit.ly/HWSupport
pt_pt: Preenche o formulário com o pedido em: bit.ly/HWSupport

source: Your heroes have been blessed by the very universe itself!
pt_pt: Os teus heróis foram abençoados pelo próprio universo!

source: Don’t miss out on Stellar Skins for Cascade and Ginger, and blind your enemies with an unearthly brilliance!
pt_pt: Não percas os visuais estelares para Cascade e Ginger e cega os teus inimigos com tanto brilho!

source: Cascade’s new vestments will cover him in a fresh coat of armor, while Ginger’s skin can be upgraded to additionally increase her health.
pt_pt: As novas roupas de Cascade irão dar-lhe uma nova armadura, enquanto que o visual de Ginger pode ser melhorado para aumentar a sua vida.

source: Become a true Dominion superstar and attain stellar triumph!
pt_pt: Torna-te uma superestrela do Domínio e consegue um triunfo estelar!

source: Take part in the new event for Guardians on the Way of Progress!
pt_pt: Participa neste evento para Guardiões no Caminho do Progresso!

source: Spring Bloom!
pt_pt: Florescer Primaveril!

source: Meet the new Super Titan!
pt_pt: Descobre a nova Supertitã!

source: She has the power to buff all of the Dark Titans!
pt_pt: Ela consegue fortalecer todos os Titãs das Trevas!

source: A famous explorer, Lady Lara Croft, has taken up residence in one of the Dominion's most luxurious mansions. It's time for her to meet the Guardians; if not them, who will uncover all the mysteries of Dominion with her? Take part in the event from May 13th to unlock Lara Croft and her lineup of Skins! The adventure won't be an easy one, so make sure to take along some Artifacts, Soul Stones, and a special Talisman to make Lara stronger and help her reach the truth!
pt_pt: A famosa exploradora Lara Croft instalou-se numa das mansões mais luxuosas do Domínio. Está na altura de ela conhecer os Guardiões; se não forem eles, quem a irá ajudar a desvendar os mistérios do Domínio? Participa no evento a partir de 13 de maio para desbloquear Lara Croft e os seus Visuais! A aventura não será fácil, por isso, certifica-te de que levas Artefactos, Pedras Anímicas e um Talismã especial para tornar Lara mais forte. Ajuda-a a descobrir a verdade!

source: YOU ARE A HERO!
pt_pt: ÉS UM HERÓI!

source: Oh, we're sorry that you've encountered such an issue We’d kindly appreciate it if you wrote us from the game app — just tap the Support button in the game settings.
pt_pt: Oh, lamentamos muito que tenhas encontrado um problema como esse Seria ótimo se nos pudesses escrever através da app do jogo: basta tocares no botão Suporte nas definições do jogo.

source: Be sure that we’ll do all we can to help you fix the problem!
pt_pt: Podes ter a certeza de que vamos fazer tudo para te ajudar com o teu problema!

source: Privacy
pt_pt: Privacidade

source: Upgrade the Princess of Eternity this November!
pt_pt: Em novembro, melhora a Princesa da Eternidade!

source: Masquerade Skin Sale
pt_pt: Promoção do Visual Mascarado

source: The summer is here! Come get new skins for Rufus, Iris, and Satori, and a Skin+ for Xe'Sha to outswim your competition!
pt_pt: O verão chegou! Obtém novos visuais para Rufus, Iris e Satori e um Visual+ para Xe'Sha. Nada mais que a concorrência!

source: Glow up and strengthen your favorite Heroes!
pt_pt: Evolui e fortalece os teus heróis favoritos!

source: Get outfits for Satori, Galahad and Xe’Sha and try them out in battles!
pt_pt: Obtém visuais para Satori, Galahad e Xe’Sha e testa-os em combate!

source: Don’t Miss Out
pt_pt: Não percas

source: The old and new passwords should not match.
pt_pt: As palavras-passe antiga e nova não podem ser iguais.

source: This new event is the cat's meow!
pt_pt: Este novo evento é de miar por mais!

source: Freeing Leprecats isn't the easiest job, but it's better than herding cats!
pt_pt: Mas atenção, que libertar os gnomolinos não é a coisa mais fácil do mundo!

source: And rest assured, these fuzzballs never let a good deed go unrewarded.
pt_pt: E não te preocupes, estas bolas de pelo sabem mostrar-se agradecidas.

source: Go ahead and start on the quests to earn as many Leprecoins as you can and purchase the Leprecat Doll, Martha Soul Stones, and other great resources at amazing prices!
pt_pt: Começa a tua missão para ganhar o máximo de Gnomoedas possível e compra Pedras Anímicas de Martha, a Boneca do Gnomolino e outros incríveis recursos a bom preço!

source: Tis the Season in the Dominion
pt_pt: É a época do Domínio

source: Outland Chest!
pt_pt: Baú de Terralém!

source: A confirmed email address cannot be disconnected.
pt_pt: Não é possível desassociar um endereço de e-mail confirmado.

source: Ancient yet youthful, Folio is the living magical book brought to life by a wizard’s error.
pt_pt: Ancestral mas com um espírito jovem, Folio é um livro a quem o erro de um feiticeiro deu vida!

source: Curious and hungry for knowledge, it harbors spells of immense power.
pt_pt: Curioso e com sede de conhecimento, traz consigo feitiços poderosos.

source: Driven by curiosity or a desire to discover its purpose, Folio joins the Guardians of Dominion to unveil the mystery of its own origins!
pt_pt: Folio é curioso e quer descobrir o seu propósito, tendo-se juntado aos Guardiões do Domínio para descobrir a sua própria origem!

source: It's the masquerade ball!
pt_pt: Hora do baile de máscaras!

source: Masked Heroes Think you can recognize your favorite heroes in masquerade outfits?
pt_pt: Heróis Mascarados Achas que consegues reconhecer os teus heróis favoritos disfarçados?

source: Celeste, Julius, Yasmine, and K'arkh are joining the party for unexpected encounters!
pt_pt: Celeste, Julius, Yasmine e K'arkh juntam-se à festa e ninguém sabe o que pode acontecer!

source: Upgrade Celeste's skin even further and make her the queen of the mysterious ball!
pt_pt: Melhora ainda mais o visual de Celeste e faz dela a rainha do baile de máscaras!

source: Master of the Forge Leave your resources in the strong and capable hands of Fafnir, the legendary smith!
pt_pt: Mestre da Forja Entrega os teus recursos ao hábil ferreiro Fafnir!

source: Complete all event quests so the master of the forge can join your team!
pt_pt: Conclui todas as missões do evento e adiciona o mestre da forja à tua equipa!

source: It's time to forge your path!
pt_pt: Hora de forjares o teu destino!

source: Dominion History New Hero Journey into Soleil’s memories!
pt_pt: História do Domínio Novo Herói Mergulha nas memórias de Soleil!

source: Help him bend an ancient deity to his will, test his mettle, and become a new Guardian of Dominion!
pt_pt: Ajuda-o a dominar uma divindade ancestral, testa o poder dele e transforma-o num novo Guardião do Domínio!

source: Space Force What do Arachne, Mojo, and Nebula have in common?
pt_pt: Força Espacial O que têm em comum Arachne, Mojo e Nebula?

source: Find the answer in the past!
pt_pt: Mergulha no passado e descobre!

source: Learn the secrets of these Heroes in a new bundle and earn bonuses for each of them!
pt_pt: Aproveita o novo conjunto, desvenda os segredos destes Heróis e ganha bónus!

source: New Talismans Don’t miss out on powerful new artifacts for Astrid and Lucas, Ziri, Lars, Lilith, K’arkh, and Krista!
pt_pt: Novos Talismãs Não percas novos e poderosos artefactos para Astrid e Lucas, Ziri, Lars, Lilith, K’arkh e Krista!

source: Play and learn all about these heroes!
pt_pt: Joga e conhece melhor estes heróis!
